In [2]:
import pandas as pd

In [3]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
data

{'Name': ['Anjal', 'Haris', 'Akash'], 'Age': [25, 22, 20]}

In [4]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
df=pd.Series(data)
df

Name    [Anjal, Haris, Akash]
Age              [25, 22, 20]
dtype: object

In [5]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
df=pd.DataFrame(data)
df

    Name  Age
0  Anjal   25
1  Haris   22
2  Akash   20

In [6]:
data={"Name":["Anjal","Haris","Akash"],"Age":[25,22,20]}
df=pd.DataFrame(data)
df

    Name  Age
0  Anjal   25
1  Haris   22
2  Akash   20